In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                  'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.469487 -1.554705
1    a  two -0.034520  0.214068
2    b  one  0.744230 -0.662561
3    b  two  1.993930  1.326260
4    a  one  1.741291  1.730116

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a    0.412428
b    1.369080
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.635902
      two    -0.034520
b     one     0.744230
      two     1.993930
Name: data1, dtype: float64

In [7]:
means.unstack()

key2       one      two
key1
a     0.635902 -0.03452
b     0.744230  1.99393

In [9]:
states = np.array(['Ohio','Califonia','Califonia','Ohio','New York'])
years = np.array([2005,2005,2006,2006,2005])
df['data1'].groupby([states,years]).mean()

Califonia  2005   -0.034520
           2006    0.744230
New York   2005    1.741291
Ohio       2005   -0.469487
           2006    1.993930
Name: data1, dtype: float64

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.412428  0.129826
b     1.369080  0.331850

In [11]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.635902  0.087706
     two  -0.034520  0.214068
b    one   0.744230 -0.662561
     two   1.993930  1.326260

In [12]:
df.groupby('key1').size()

key1
a    3
b    2
dtype: int64

In [13]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [14]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.469487 -1.554705
4    a  one  1.741291  1.730116
('a', 'two')
  key1 key2    data1     data2
1    a  two -0.03452  0.214068
('b', 'one')
  key1 key2    data1     data2
2    b  one  0.74423 -0.662561
('b', 'two')
  key1 key2    data1    data2
3    b  two  1.99393  1.32626

In [15]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2    data1     data2
2    b  one  0.74423 -0.662561
3    b  two  1.99393  1.326260

In [16]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [17]:
grouped = df.groupby(df.dtypes,axis=1)

In [18]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.469487 -1.554705
1 -0.034520  0.214068
2  0.744230 -0.662561
3  1.993930  1.326260
4  1.741291  1.730116
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [20]:
df('data2').groupby(df['key1','key2']).mean()

TypeError: 'DataFrame' object is not callable

In [21]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.087706
     two   0.214068
b    one  -0.662561
     two   1.326260

In [23]:
people = pd.DataFrame(np.random.randn(5,5),
                     index=['Joe','Steve','Wes','Jim','Travis'],
                     columns=['a','b','c','d','e'])
people

               a         b         c         d         e
Joe     1.194443 -1.168802 -2.573813 -1.035630  0.747495
Steve  -0.953598  0.853878 -0.451851 -1.112246 -0.731275
Wes     0.761549 -1.853132 -0.916628  0.738263  1.076286
Jim     0.239843 -0.421073 -0.609636 -0.869691  1.316173
Travis -0.781565 -1.867315  0.875202  0.690258  0.221232

In [26]:
people.iloc[2,[1,2]] = np.nan

In [27]:
people

               a         b         c         d         e
Joe     1.194443 -1.168802 -2.573813 -1.035630  0.747495
Steve  -0.953598  0.853878 -0.451851 -1.112246 -0.731275
Wes     0.761549       NaN       NaN  0.738263  1.076286
Jim     0.239843 -0.421073 -0.609636 -0.869691  1.316173
Travis -0.781565 -1.867315  0.875202  0.690258  0.221232

In [28]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [29]:
by_column = people.groupby(mapping,axis=1)

In [30]:
by_column.sum()

            blue       red
Joe    -3.609443  0.773136
Steve  -1.564097 -0.830995
Wes     0.738263  1.837835
Jim    -1.479327  1.134943
Travis  1.565461 -2.427649

In [31]:
map_series = pd.Series(mapping)

In [32]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [33]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [34]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.195835 -1.589875 -3.183449 -1.167058  3.139954
5 -0.953598  0.853878 -0.451851 -1.112246 -0.731275
6 -0.781565 -1.867315  0.875202  0.690258  0.221232

In [35]:
key_list = ['one','one','one','two','two']

In [36]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one  0.761549 -1.168802 -2.573813 -1.035630  0.747495
  two  0.239843 -0.421073 -0.609636 -0.869691  1.316173
5 one -0.953598  0.853878 -0.451851 -1.112246 -0.731275
6 two -0.781565 -1.867315  0.875202  0.690258  0.221232

In [37]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
                                    [1,3,4,1,3]],
                                   names=['cty','tenor'])

In [39]:
hier_df = pd.DataFrame(np.random.randn(4,5),columns=columns)

In [40]:
hier_df

cty          US                            JP
tenor         1         3         4         1         3
0     -1.613511 -0.164808 -0.730409  0.426587 -0.198320
1      0.064770 -0.991741 -0.039688  0.838939 -1.933495
2      0.551736  0.555402 -0.234944  1.056983 -1.036465
3     -0.079194 -1.909099 -0.381875 -0.109947  0.496636

In [41]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [42]:
df

  key1 key2     data1     data2
0    a  one -0.469487 -1.554705
1    a  two -0.034520  0.214068
2    b  one  0.744230 -0.662561
3    b  two  1.993930  1.326260
4    a  one  1.741291  1.730116

In [46]:
grouped = df.groupby('key1')
grouped['data1']

In [44]:
grouped['data1'].quantile(0.9)

key1
a    1.386129
b    1.868960
Name: data1, dtype: float64

In [49]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [50]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.210777  3.284821
b     1.249700  1.988822

In [52]:
grouped.describe().stack()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.412428  0.129826
     std    1.171199  1.644030
     min   -0.469487 -1.554705
     25%   -0.252003 -0.670319
     50%   -0.034520  0.214068
     75%    0.853385  0.972092
     max    1.741291  1.730116
b    count  2.000000  2.000000
     mean   1.369080  0.331850
     std    0.883672  1.406309
     min    0.744230 -0.662561
     25%    1.056655 -0.165356
     50%    1.369080  0.331850
     75%    1.681505  0.829055
     max    1.993930  1.326260

In [53]:
frame = pd.DataFrame({'data1':np.random.randn(1000),
                     'data2':np.random.randn(1000)})

In [54]:
quartiles = pd.cut(frame.data1,4)

In [55]:
quartiles

0      (-1.994, -0.292]
1      (-1.994, -0.292]
2        (-0.292, 1.41]
3        (-0.292, 1.41]
4        (-0.292, 1.41]
5        (-0.292, 1.41]
6      (-1.994, -0.292]
7         (1.41, 3.112]
8      (-1.994, -0.292]
9        (-0.292, 1.41]
10       (-0.292, 1.41]
11     (-1.994, -0.292]
12     (-1.994, -0.292]
13       (-0.292, 1.41]
14       (-0.292, 1.41]
15     (-1.994, -0.292]
16        (1.41, 3.112]
17       (-0.292, 1.41]
18     (-1.994, -0.292]
19       (-0.292, 1.41]
20       (-0.292, 1.41]
21       (-0.292, 1.41]
22       (-0.292, 1.41]
23     (-1.994, -0.292]
24       (-0.292, 1.41]
25     (-1.994, -0.292]
26       (-0.292, 1.41]
27     (-1.994, -0.292]
28     (-1.994, -0.292]
29     (-1.994, -0.292]
             ...
970      (-0.292, 1.41]
971    (-1.994, -0.292]
972      (-0.292, 1.41]
973      (-0.292, 1.41]
974       (1.41, 3.112]
975    (-3.702, -1.994]
976      (-0.292, 1.41]
977    (-1.994, -0.292]
978      (-0.292, 1.41]
979      (-0.292, 1.41]
980      (-0.292, 1.41]
981      (-0.292, 1.41]
982    (-3.702, -1.994]
983      (-0.292, 1.41]
984      (-0.292, 1.41]
985      (-0.292, 1.41]
986    (-1.994, -0.292]
987    (-1.994, -0.292]
988      (-0.292, 1.41]
989    (-3.702, -1.994]
990      (-0.292, 1.41]
991    (-1.994, -0.292]
992      (-0.292, 1.41]
993    (-1.994, -0.292]
994    (-1.994, -0.292]
995    (-1.994, -0.292]
996      (-0.292, 1.41]
997      (-0.292, 1.41]
998      (-0.292, 1.41]
999    (-1.994, -0.292]
Name: data1, Length: 1000, dtype: category
Categories (4, interval[float64]): [(-3.702, -1.994] < (-1.994, -0.292] < (-0.292, 1.41] < (1.41, 3.112]]

In [56]:
def get_stats(group):
    return{'min':group.min(),'max':group.max(),
          'count':group.count(),'mean':group.mean()}

In [57]:
grouped = frame.data2.groupby(quartiles)

In [58]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.702, -1.994]   25.0  1.771910 -0.245070 -3.218768
(-1.994, -0.292]  357.0  3.025140  0.082510 -3.527713
(-0.292, 1.41]    547.0  3.966193 -0.008029 -3.312272
(1.41, 3.112]      71.0  2.418802  0.191885 -1.825097

In [59]:
grouping = pd.qcut(frame.data1,10,labels=False)

In [60]:
grouped = frame.data2.groupby(grouping)

In [61]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.406096 -0.031649 -3.218768
1      100.0  3.025140  0.169222 -2.295766
2      100.0  2.383939  0.075301 -3.527713
3      100.0  2.333213 -0.008838 -2.806293
4      100.0  2.711083 -0.194086 -2.601518
5      100.0  3.208810  0.024070 -2.311546
6      100.0  3.966193  0.104960 -3.312272
7      100.0  2.339478 -0.115021 -2.101519
8      100.0  2.275292  0.108767 -2.851373
9      100.0  2.418802  0.192885 -1.825097

In [62]:
s = pd.Series(np.random.randn(6))

In [63]:
s[::2] = np.nan

In [64]:
s

0         NaN
1    0.065559
2         NaN
3    1.262683
4         NaN
5   -1.436589
dtype: float64

In [66]:
s.fillna(s.mean())

0   -0.036116
1    0.065559
2   -0.036116
3    1.262683
4   -0.036116
5   -1.436589
dtype: float64

In [70]:
states = ['Ohio','New York','Vermont','Florida','Oregon','Nevada','Califonia','Idaho']

In [68]:
group_key = ['east']*4 + ['west']*4

In [71]:
data = pd.Series(np.random.randn(8),index=states)

In [72]:
data

Ohio         0.895276
New York     0.440011
Vermont      0.186317
Florida     -0.955346
Oregon      -0.124110
Nevada       0.002806
Califonia   -0.657893
Idaho        1.120154
dtype: float64

In [73]:
data[2:4] = np.nan

In [74]:
data

Ohio         0.895276
New York     0.440011
Vermont           NaN
Florida           NaN
Oregon      -0.124110
Nevada       0.002806
Califonia   -0.657893
Idaho        1.120154
dtype: float64

In [75]:
data.groupby(group_key).mean()

east    0.667644
west    0.085239
dtype: float64

In [76]:
fill_mean = lambda g: g.fillna(g.mean())

In [78]:
data.groupby(group_key).apply(fill_mean)

Ohio         0.895276
New York     0.440011
Vermont      0.667644
Florida      0.667644
Oregon      -0.124110
Nevada       0.002806
Califonia   -0.657893
Idaho        1.120154
dtype: float64

In [79]:
fill_value = {'east':0.5,'west':-1}

In [80]:
fill_func = lambda g:g.fillna(fill_value[g.name])

In [82]:
data.groupby(group_key).apply(fill_func)

Ohio         0.895276
New York     0.440011
Vermont      0.500000
Florida      0.500000
Oregon      -0.124110
Nevada       0.002806
Califonia   -0.657893
Idaho        1.120154
dtype: float64

In [84]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [85]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [86]:
def draw(deck,n=5):
    return deck.sample(n)

In [87]:
draw(deck)

QS    10
QC    10
6D     6
KD    10
9D     9
dtype: int64

In [88]:
get_suit = lambda card: card[-1]

In [89]:
deck.groupby(get_suit).apply(draw, n=2)

C  4C     4
   JC    10
D  9D     9
   KD    10
H  7H     7
   9H     9
S  4S     4
   9S     9
dtype: int64

In [91]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

2C    2
4C    4
AD    1
6D    6
9H    9
AH    1
7S    7
3S    3
dtype: int64

In [92]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a','b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [93]:
df

  category      data   weights
0        a  1.367085  0.339215
1        a  0.218551  0.012544
2        a -0.174212  0.266775
3        a -1.711779  0.483748
4        b  1.283932  0.441876
5        b  0.036850  0.132645
6        b  2.067820  0.518724
7        b -0.635993  0.773620

In [95]:
grouped = df.groupby('category')

In [96]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [97]:
grouped.apply(get_wavg)

category
a   -0.370203
b    0.617526
dtype: float64

In [98]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)

FileNotFoundError: [Errno 2] File b'examples/stock_px_2.csv' does not exist: b'examples/stock_px_2.csv'